{
    "architectures": ["GPTNeoXForCausalLM"],
    "model_type": "gpt_neox",
  
    "vocab_size": 32000, 
    "bos_token_id": 1, 
    "eos_token_id": 2,
    "pad_token_id": 3,
    "unk_token_id": 0,
    "tie_word_embeddings": false,
  
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "num_hidden_layers": 16,
  
    "num_attention_heads": 8,
    "head_dim": 128,
  
    "hidden_act": "silu",
    "layer_norm_eps": 1e-05,
  
    "attention_bias": false,
    "use_parallel_residual": true,
    "hidden_dropout_prob": 0.0,
  
    "initializer_range": 0.0,
    "use_cache": true,
  
    "initial_context_length": 1024,
    "max_position_embeddings": 1024,

    "torch_dtype": "float16"
  }
